#ifndef COMMANDS

/////////////////////////////////
//! 4ый бит отвечаетза наличие аргумента у команды
//! при этом, если включен 3 бит, то аргументом не может быть число
//! 5ый бит включен, если операция с регистрами

DEF_CMD(HLT,   0b10000000,   0)
DEF_CMD(ADD,   0b00000001,   0)
DEF_CMD(SUB,   0b00000010,   0)
DEF_CMD(MUL,   0b00000011,   0)
DEF_CMD(DIV,   0b00000100,   0)
DEF_CMD(SQRT,  0b00000101,   0)
DEF_CMD(IN,    0b00000110,   0)
DEF_CMD(OUT,   0b00000111,   0)

DEF_CMD(PUSH,  0b00010010,   1)
DEF_CMD(POP,   0b00011011,   1)

DEF_CMD(RPUSH, 0b00110010,   1)
DEF_CMD(RPOP,  0b00111011,   1)

#endif
